In [1]:
import pandas as pd

### f) 중복되는 데이터가 존재하는 경우의 열 단위 병합

In [4]:
df_first = pd.DataFrame({'아이디':['hello','world','python','hello'], '결재금액': [14000, 13000, 15000, 13000]})
df_first
df_second = pd.DataFrame({'아이디':['hello','python','python','world'], '결재금액': [300, 500, 100, 200]})
df_second
pd.merge(df_first, df_second, on='아이디')

      아이디  결재금액_x  결재금액_y
0   hello   14000     300
1   world   13000     200
2  python   15000     500
3  python   15000     100
4   hello   13000     300

### g)공통컬럼이 두 개 이상 존재하는 경우의 병합
#### 두 데이터 프레임에서 이름이 같은 열은 모두 키가 된다.

In [5]:
df_a = pd.DataFrame({'고객명':['민수','수영'],'데이터':['20000','10000'], '날짜':['2024-01-01','2024-01-01']})
df_a

  고객명    데이터          날짜
0  민수  20000  2024-01-01
1  수영  10000  2024-01-01

In [8]:
df_b = pd.DataFrame({'고객명':['민수','수영'],'데이터':['21세','22세']})
df_b

  고객명  데이터
0  민수  21세
1  수영  22세

In [9]:
pd.merge(df_a, df_b)

Empty DataFrame
Columns: [고객명, 데이터, 날짜]
Index: []

### on 파라미터를 사용하여 기준열 지정하기
####  df_a  데이터는 금액을 의미하지만 df_b  데이터는 나이를 의미하므로 병합의 기준으로 사용되어서는 안된다.

In [13]:
#기준열이 아니면서 이름이 같은 열에는  _x, _y  같은 접미사가 붙는다
pd.merge(df_a, df_b, on=['고객명'])

  고객명  데이터_x          날짜 데이터_y
0  민수  20000  2024-01-01   21세
1  수영  10000  2024-01-01   22세

#### 컬럼명을 수정하자 금액, 나이로...

In [16]:
m_res = pd.merge(df_a, df_b, on=['고객명'])
m_res2 = m_res.rename(columns={'데이터_x':'금액','데이터_y':'나이'})
m_res2

  고객명     금액          날짜   나이
0  민수  20000  2024-01-01  21세
1  수영  10000  2024-01-01  22세

## h) 공통 컬럼이 존재하지 않는 경우의 병합

In [17]:
국어점수 = pd.DataFrame({'이름':['영희','철수'], '국어':[87, 91]})
국어점수

   이름  국어
0  영희  87
1  철수  91

In [21]:
영어점수 = pd.DataFrame({'성명':['영희','철수'], '영어':[87, 91]})
영어점수

   성명  영어
0  영희  87
1  철수  91

In [22]:
국영 = pd.merge(국어점수, 영어점수, left_on=['이름'], right_on=['성명'])
국영

   이름  국어  성명  영어
0  영희  87  영희  87
1  철수  91  철수  91

In [23]:
국영.drop('성명', axis=1, inplace=True)

In [31]:
수학점수 = pd.DataFrame({'수학':[90, 82]}, index=['민철','봉구'])
과학점수 = pd.DataFrame({'과학':[90, 82]}, index=['민철','철수'])
print(수학점수)
print(과학점수)

    수학
민철  90
봉구  82
    과학
민철  90
철수  82

In [32]:
수과 = pd.merge(수학점수, 과학점수, left_index=True, right_index=True)
수과

    수학  과학
민철  90  90

In [33]:
수과 = pd.merge(수학점수, 과학점수, left_index=True, right_index=True, how="outer")
수과

      수학    과학
민철  90.0  90.0
봉구  82.0   NaN
철수   NaN  82.0

In [36]:
한국사 = pd.DataFrame({'한국사':[90, 82]}, index=['영희','철수'])
세계사 = pd.DataFrame({'세계사':[90, 82]}, index=['영희','철수'])

In [41]:
한세 = pd.merge(한국사, 세계사, left_index=True, right_index=True)
한세

    한국사  세계사
영희   90   90
철수   82   82

#### 새롭게 인덱스로 지정할 데이터 추출

In [42]:
이름 = list(한세['이름'])
이름

KeyError: '이름'

#### 2) before:after 형식의 딕셔너리로 구성

In [ ]:
indexDic = {}
for i,v in enumerate(이름):
    indexDic[i] = v

indexDic

### 3) 인덱스 변경`

In [ ]:
한세.rename(index=indexDic, inplace=True)
한세

In [ ]:
한세.drop('이름', axis=1, inplace=True)
한세

In [1]:
step = 5

In [2]:
pyplot.hist(df['영어'], bins=step)
pyplot.show()

NameError: name 'pyplot' is not defined